wenij/microbit_v2_nrf_sdk/examples/nrf5_sdk/twi_sensor/lsm303agr_reg.h
/**
  ******************************************************************************
  * @file    lsm303agr_reg.h
  * @author  Sensors Software Solution Team
  * @brief   This file contains all the functions prototypes for the
  *          lsm303agr_reg.c driver.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LSM303AGR_REGS_H
#define LSM303AGR_REGS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

/** @addtogroup LSM303AGR
  * @{
  *
  */

/** @defgroup Endianness definitions
  * @{
  *
  */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__
#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN    4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
  * by uncommenting the define which fits your platform endianness
  */
//#define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER    DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */
#define DRV_LITTLE_ENDIAN  __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN     __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER     __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

/**
  * @}
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7       : 1;
  uint8_t bit6       : 1;
  uint8_t bit5       : 1;
  uint8_t bit4       : 1;
  uint8_t bit3       : 1;
  uint8_t bit2       : 1;
  uint8_t bit1       : 1;
  uint8_t bit0       : 1;
#endif /* DRV_BYTE_ORDER */
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, const uint8_t *, uint16_t);
typedef int32_t (*stmdev_read_ptr)(void *, uint8_t, uint8_t *, uint16_t);
typedef void (*stmdev_mdelay_ptr)(uint32_t millisec);

typedef struct
{
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Component optional fields **/
  stmdev_mdelay_ptr   mdelay;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
  *              You can create a sensor configuration by your own or using
  *              Unico / Unicleo tools available on STMicroelectronics
  *              web site.
  *
  * @{
  *
  */

typedef struct
{
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
  * @}
  *
  */

/** @defgroup lsm303agr_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format**/
#define LSM303AGR_I2C_ADD_XL       0x19U
#define LSM303AGR_I2C_ADD_MG       0x1EU

/** Device Identification (Who am I) **/
#define LSM303AGR_ID_XL            0x33U
#define LSM303AGR_ID_MG            0x40U

/**
  * @}
  *
  */

#define LSM303AGR_STATUS_REG_AUX_A           0x07U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01            : 2;
  uint8_t tda                    : 1;
  uint8_t not_used_02            : 3;
  uint8_t tor                    : 1;
  uint8_t not_used_03            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_03            : 1;
  uint8_t tor                    : 1;
  uint8_t not_used_02            : 3;
  uint8_t tda                    : 1;
  uint8_t not_used_01            : 2;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_status_reg_aux_a_t;

#define LSM303AGR_OUT_TEMP_L_A               0x0CU
#define LSM303AGR_OUT_TEMP_H_A               0x0DU
#define LSM303AGR_INT_COUNTER_REG_A          0x0EU
#define LSM303AGR_WHO_AM_I_A                 0x0FU

#define LSM303AGR_TEMP_CFG_REG_A             0x1FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01            : 6;
  uint8_t temp_en                : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t temp_en                : 2;
  uint8_t not_used_01            : 6;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_temp_cfg_reg_a_t;

#define LSM303AGR_CTRL_REG1_A                0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xen                    : 1;
  uint8_t yen                    : 1;
  uint8_t zen                    : 1;
  uint8_t lpen                   : 1;
  uint8_t odr                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr                    : 4;
  uint8_t lpen                   : 1;
  uint8_t zen                    : 1;
  uint8_t yen                    : 1;
  uint8_t xen                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_ctrl_reg1_a_t;

#define LSM303AGR_CTRL_REG2_A                0x21U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
uint8_t hp                     :
  3; /* HPCLICK + HPIS2 + HPIS1 -> HP */
  uint8_t fds                    : 1;
  uint8_t hpcf                   : 2;
  uint8_t hpm                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t hpm                    : 2;
  uint8_t hpcf                   : 2;
  uint8_t fds                    : 1;
uint8_t hp                     :
  3; /* HPCLICK + HPIS2 + HPIS1 -> HP */
#endif /* DRV_BYTE_ORDER */
} lsm303agr_ctrl_reg2_a_t;

#define LSM303AGR_CTRL_REG3_A                0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t i1_overrun             : 1;
  uint8_t i1_wtm                 : 1;
  uint8_t i1_drdy2               : 1;
  uint8_t i1_drdy1               : 1;
  uint8_t i1_aoi2                : 1;
  uint8_t i1_aoi1                : 1;
  uint8_t i1_click               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t i1_click               : 1;
  uint8_t i1_aoi1                : 1;
  uint8_t i1_aoi2                : 1;
  uint8_t i1_drdy1               : 1;
  uint8_t i1_drdy2               : 1;
  uint8_t i1_wtm                 : 1;
  uint8_t i1_overrun             : 1;
  uint8_t not_used_01            : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_ctrl_reg3_a_t;

#define LSM303AGR_CTRL_REG4_A                0x23U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t spi_enable             : 1;
  uint8_t st                     : 2;
  uint8_t hr                     : 1;
  uint8_t fs                     : 2;
  uint8_t ble                    : 1;
  uint8_t bdu                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bdu                    : 1;
  uint8_t ble                    : 1;
  uint8_t fs                     : 2;
  uint8_t hr                     : 1;
  uint8_t st                     : 2;
  uint8_t spi_enable             : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_ctrl_reg4_a_t;

#define LSM303AGR_CTRL_REG5_A                0x24U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t d4d_int2               : 1;
  uint8_t lir_int2               : 1;
  uint8_t d4d_int1               : 1;
  uint8_t lir_int1               : 1;
  uint8_t not_used_01            : 2;
  uint8_t fifo_en                : 1;
  uint8_t boot                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot                   : 1;
  uint8_t fifo_en                : 1;
  uint8_t not_used_01            : 2;
  uint8_t lir_int1               : 1;
  uint8_t d4d_int1               : 1;
  uint8_t lir_int2               : 1;
  uint8_t d4d_int2               : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_ctrl_reg5_a_t;

#define LSM303AGR_CTRL_REG6_A               0x25U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t h_lactive              : 1;
  uint8_t not_used_02            : 1;
  uint8_t p2_act                 : 1;
  uint8_t boot_i2                : 1;
  uint8_t i2_int2                : 1;
  uint8_t i2_int1                : 1;
  uint8_t i2_clicken             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t i2_clicken             : 1;
  uint8_t i2_int1                : 1;
  uint8_t i2_int2                : 1;
  uint8_t boot_i2                : 1;
  uint8_t p2_act                 : 1;
  uint8_t not_used_02            : 1;
  uint8_t h_lactive              : 1;
  uint8_t not_used_01            : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_ctrl_reg6_a_t;

