wenij/microbit_v2_nrf_sdk/examples/nrf5_sdk/twi_sensor/lsm303agr_reg.h
#define LSM303AGR_INT2_THS_A                0x36U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths                    : 7;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t ths                    : 7;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int2_ths_a_t;

#define LSM303AGR_INT2_DURATION_A           0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t d                      : 7;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t d                      : 7;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int2_duration_a_t;

#define LSM303AGR_CLICK_CFG_A               0x38U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xs                     : 1;
  uint8_t xd                     : 1;
  uint8_t ys                     : 1;
  uint8_t yd                     : 1;
  uint8_t zs                     : 1;
  uint8_t zd                     : 1;
  uint8_t not_used_01            : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 2;
  uint8_t zd                     : 1;
  uint8_t zs                     : 1;
  uint8_t yd                     : 1;
  uint8_t ys                     : 1;
  uint8_t xd                     : 1;
  uint8_t xs                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_click_cfg_a_t;

#define LSM303AGR_CLICK_SRC_A               0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t x                      : 1;
  uint8_t y                      : 1;
  uint8_t z                      : 1;
  uint8_t sign                   : 1;
  uint8_t sclick                 : 1;
  uint8_t dclick                 : 1;
  uint8_t ia                     : 1;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t ia                     : 1;
  uint8_t dclick                 : 1;
  uint8_t sclick                 : 1;
  uint8_t sign                   : 1;
  uint8_t z                      : 1;
  uint8_t y                      : 1;
  uint8_t x                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_click_src_a_t;

#define LSM303AGR_CLICK_THS_A               0x3AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ths                    : 7;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t ths                    : 7;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_click_ths_a_t;

#define LSM303AGR_TIME_LIMIT_A              0x3BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tli                    : 7;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t tli                    : 7;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_time_limit_a_t;

#define LSM303AGR_TIME_LATENCY_A            0x3CU
typedef struct
{
  uint8_t tla                    : 8;
} lsm303agr_time_latency_a_t;

#define LSM303AGR_TIME_WINDOW_A             0x3DU
typedef struct
{
  uint8_t tw                     : 8;
} lsm303agr_time_window_a_t;

#define LSM303AGR_ACT_THS_A                 0x3EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t acth                   : 7;
  uint8_t not_used_01            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 1;
  uint8_t acth                   : 7;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_act_ths_a_t;

#define LSM303AGR_ACT_DUR_A                 0x3FU
typedef struct
{
  uint8_t actd                   : 8;
} lsm303agr_act_dur_a_t;

#define LSM303AGR_OFFSET_X_REG_L_M          0x45U
#define LSM303AGR_OFFSET_X_REG_H_M          0x46U
#define LSM303AGR_OFFSET_Y_REG_L_M          0x47U
#define LSM303AGR_OFFSET_Y_REG_H_M          0x48U
#define LSM303AGR_OFFSET_Z_REG_L_M          0x49U
#define LSM303AGR_OFFSET_Z_REG_H_M          0x4AU
#define LSM303AGR_WHO_AM_I_M                0x4FU
#define LSM303AGR_CFG_REG_A_M               0x60U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t md                     : 2;
  uint8_t odr                    : 2;
  uint8_t lp                     : 1;
  uint8_t soft_rst               : 1;
  uint8_t reboot                 : 1;
  uint8_t comp_temp_en           : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t comp_temp_en           : 1;
  uint8_t reboot                 : 1;
  uint8_t soft_rst               : 1;
  uint8_t lp                     : 1;
  uint8_t odr                    : 2;
  uint8_t md                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_cfg_reg_a_m_t;

#define LSM303AGR_CFG_REG_B_M               0x61U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t lpf                    : 1;
  uint8_t set_rst                : 2; /* OFF_CANC + Set_FREQ */
  uint8_t int_on_dataoff         : 1;
  uint8_t off_canc_one_shot      : 1;
  uint8_t not_used_01            : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01            : 3;
  uint8_t off_canc_one_shot      : 1;
  uint8_t int_on_dataoff         : 1;
  uint8_t set_rst                : 2; /* OFF_CANC + Set_FREQ */
  uint8_t lpf                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_cfg_reg_b_m_t;

#define LSM303AGR_CFG_REG_C_M               0x62U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int_mag                : 1;
  uint8_t self_test              : 1;
  uint8_t not_used_01            : 1;
  uint8_t ble                    : 1;
  uint8_t bdu                    : 1;
  uint8_t i2c_dis                : 1;
  uint8_t int_mag_pin            : 1;
  uint8_t not_used_02            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02            : 1;
  uint8_t int_mag_pin            : 1;
  uint8_t i2c_dis                : 1;
  uint8_t bdu                    : 1;
  uint8_t ble                    : 1;
  uint8_t not_used_01            : 1;
  uint8_t self_test              : 1;
  uint8_t int_mag                : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_cfg_reg_c_m_t;

#define LSM303AGR_INT_CRTL_REG_M            0x63U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ien                    : 1;
  uint8_t iel                    : 1;
  uint8_t iea                    : 1;
  uint8_t not_used_01            : 2;
  uint8_t zien                   : 1;
  uint8_t yien                   : 1;
  uint8_t xien                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t xien                   : 1;
  uint8_t yien                   : 1;
  uint8_t zien                   : 1;
  uint8_t not_used_01            : 2;
  uint8_t iea                    : 1;
  uint8_t iel                    : 1;
  uint8_t ien                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int_crtl_reg_m_t;

