wenij/microbit_v2_nrf_sdk/examples/nrf5_sdk/twi_sensor/lsm303agr_reg.h
#define LSM303AGR_INT_SOURCE_REG_M          0x64U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t _int                   : 1;
  uint8_t mroi                   : 1;
  uint8_t n_th_s_z               : 1;
  uint8_t n_th_s_y               : 1;
  uint8_t n_th_s_x               : 1;
  uint8_t p_th_s_z               : 1;
  uint8_t p_th_s_y               : 1;
  uint8_t p_th_s_x               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t p_th_s_x               : 1;
  uint8_t p_th_s_y               : 1;
  uint8_t p_th_s_z               : 1;
  uint8_t n_th_s_x               : 1;
  uint8_t n_th_s_y               : 1;
  uint8_t n_th_s_z               : 1;
  uint8_t mroi                   : 1;
  uint8_t _int                   : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_int_source_reg_m_t;

#define LSM303AGR_INT_THS_L_REG_M           0x65U
#define LSM303AGR_INT_THS_H_REG_M           0x66U
#define LSM303AGR_STATUS_REG_M              0x67U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xda                    : 1;
  uint8_t yda                    : 1;
  uint8_t zda                    : 1;
  uint8_t zyxda                  : 1;
  uint8_t _xor                   : 1;
  uint8_t yor                    : 1;
  uint8_t zor                    : 1;
  uint8_t zyxor                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t zyxor                  : 1;
  uint8_t zor                    : 1;
  uint8_t yor                    : 1;
  uint8_t _xor                   : 1;
  uint8_t zyxda                  : 1;
  uint8_t zda                    : 1;
  uint8_t yda                    : 1;
  uint8_t xda                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm303agr_status_reg_m_t;

#define LSM303AGR_OUTX_L_REG_M              0x68U
#define LSM303AGR_OUTX_H_REG_M              0x69U
#define LSM303AGR_OUTY_L_REG_M              0x6AU
#define LSM303AGR_OUTY_H_REG_M              0x6BU
#define LSM303AGR_OUTZ_L_REG_M              0x6CU
#define LSM303AGR_OUTZ_H_REG_M              0x6DU

/**
  * @defgroup LSM303AGR_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  lsm303agr_status_reg_aux_a_t       status_reg_aux_a;
  lsm303agr_temp_cfg_reg_a_t         temp_cfg_reg_a;
  lsm303agr_ctrl_reg1_a_t            ctrl_reg1_a;
  lsm303agr_ctrl_reg2_a_t            ctrl_reg2_a;
  lsm303agr_ctrl_reg3_a_t            ctrl_reg3_a;
  lsm303agr_ctrl_reg4_a_t            ctrl_reg4_a;
  lsm303agr_ctrl_reg5_a_t            ctrl_reg5_a;
  lsm303agr_ctrl_reg6_a_t            ctrl_reg6_a;
  lsm303agr_status_reg_a_t           status_reg_a;
  lsm303agr_fifo_ctrl_reg_a_t        fifo_ctrl_reg_a;
  lsm303agr_fifo_src_reg_a_t         fifo_src_reg_a;
  lsm303agr_int1_cfg_a_t             int1_cfg_a;
  lsm303agr_int1_src_a_t             int1_src_a;
  lsm303agr_int1_ths_a_t             int1_ths_a;
  lsm303agr_int1_duration_a_t        int1_duration_a;
  lsm303agr_int2_cfg_a_t             int2_cfg_a;
  lsm303agr_int2_src_a_t             int2_src_a;
  lsm303agr_int2_ths_a_t             int2_ths_a;
  lsm303agr_int2_duration_a_t        int2_duration_a;
  lsm303agr_click_cfg_a_t            click_cfg_a;
  lsm303agr_click_src_a_t            click_src_a;
  lsm303agr_click_ths_a_t            click_ths_a;
  lsm303agr_time_limit_a_t           time_limit_a;
  lsm303agr_time_latency_a_t         time_latency_a;
  lsm303agr_time_window_a_t          time_window_a;
  lsm303agr_act_ths_a_t              act_ths_a;
  lsm303agr_act_dur_a_t              act_dur_a;
  lsm303agr_cfg_reg_a_m_t            cfg_reg_a_m;
  lsm303agr_cfg_reg_b_m_t            cfg_reg_b_m;
  lsm303agr_cfg_reg_c_m_t            cfg_reg_c_m;
  lsm303agr_int_crtl_reg_m_t         int_crtl_reg_m;
  lsm303agr_int_source_reg_m_t       int_source_reg_m;
  lsm303agr_status_reg_m_t           status_reg_m;
  bitwise_t                          bitwise;
  uint8_t                            byte;
} lsm303agr_reg_t;

/**
  * @}
  *
  */

int32_t lsm303agr_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);
int32_t lsm303agr_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);

float_t lsm303agr_from_fs_2g_hr_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_4g_hr_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_8g_hr_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_16g_hr_to_mg(int16_t lsb);
float_t lsm303agr_from_lsb_hr_to_celsius(int16_t lsb);

float_t lsm303agr_from_fs_2g_nm_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_4g_nm_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_8g_nm_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_16g_nm_to_mg(int16_t lsb);
float_t lsm303agr_from_lsb_nm_to_celsius(int16_t lsb);

float_t lsm303agr_from_fs_2g_lp_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_4g_lp_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_8g_lp_to_mg(int16_t lsb);
float_t lsm303agr_from_fs_16g_lp_to_mg(int16_t lsb);
float_t lsm303agr_from_lsb_lp_to_celsius(int16_t lsb);

float_t lsm303agr_from_lsb_to_mgauss(int16_t lsb);

int32_t lsm303agr_temp_status_reg_get(stmdev_ctx_t *ctx,
                                      uint8_t *buff);

int32_t lsm303agr_temp_data_ready_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm303agr_temp_data_ovr_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm303agr_temperature_raw_get(stmdev_ctx_t *ctx,
                                      int16_t *val);

typedef enum
{
  LSM303AGR_TEMP_DISABLE  = 0,
  LSM303AGR_TEMP_ENABLE   = 3,
} lsm303agr_temp_en_a_t;
